{
  "resourceType": "StructureDefinition",
  "id": "HdBe-AbilityToEat",
  "language": "en-US",
  "extension": [
    {
      "url": "http://hl7.org/fhir/StructureDefinition/resource-effectivePeriod",
      "valuePeriod": {
        "start": "2020-09-01T00:00:00+02:00"
      }
    }
  ],
  "url": "https://fhir.healthdata.be/StructureDefinition/LogicalModel/HdBe-AbilityToEat",
  "name": "HdBeAbilityToEat",
  "_name": {
    "extension": [
      {
        "url": "http://hl7.org/fhir/StructureDefinition/translation",
        "extension": [
          {
            "url": "lang",
            "valueCode": "nl-NL"
          },
          {
            "url": "content",
            "valueMarkdown": "HdBe-VermogenTotEten"
          }
        ]
      }
    ]
  },
  "title": "HdBe AbilityToEat",
  "status": "draft",
  "date": "2022-07-07T15:04:03.2592055+00:00",
  "publisher": "Healthdata.be (Sciensano)",
  "contact": [
    {
      "name": "Service portal – healthdata.be",
      "telecom": [
        {
          "system": "url",
          "value": "https://sciensano.service-now.com/sp",
          "use": "work"
        }
      ]
    }
  ],
  "description": "Being able to independently prepare and consume food is part of self-care. Limitations in this ability indicate a reduced ability to cope for oneself. \r\nThis activity and activities such as those including drinking, getting dressed and bathing are also known as activities of daily living (ADL). These are the activities people go through in daily life. The extent to which a person is able to do all these activities by themselves is a measure for their total ability to do things independently.\r\n\r\n#### Purpose\r\nInformation on limitations in a patient’s ability to make and eat their own food is important in determining the nature and intensity of the care the patient needs. In a transfer situation, it offers the receiving organization the ability to anticipate the intensity of the care to be given to the patient, enabling continuity in healthcare for the patient. \r\nIf policy has been implemented to improve a patient’s ability to do things independently, the entered extent of independence helps to determine the efficiency of the treatment.\r\n\r\n#### Evidence Base\r\nThe definitions of the concepts were (partially) taken from the ICNP definitions. \r\n\r\nIn addition to this information model, there are other tools to record independence, such as the KATZ-ADL and the BarthelIndex. The KATZ-ADL is mainly used for vulnerable seniors and the BarthelIndex is mainly used for patients who have had a stroke. \r\n\r\nThis information model evaluates the ability to eat on a three-point scale. In the KATZ-ADL and in the BarthelIndex, this falls under the aspect of Self-feeding. In these two tools, the ability is scored on a scale with fewer points.",
  "_description": {
    "extension": [
      {
        "url": "http://hl7.org/fhir/StructureDefinition/translation",
        "extension": [
          {
            "url": "lang",
            "valueCode": "nl-NL"
          },
          {
            "url": "content",
            "valueMarkdown": "Zelfstandig eten kunnen bereiden en nuttigen is een onderdeel van zelfzorg. Beperkingen in dit vermogen duiden op een verminderde zelfredzaamheid op dit gebied.\r\nDeze activiteit wordt samen met activiteiten zoals onder andere drinken, zich kleden en zich wassen, ook aangeduid als algemene dagelijkse levensverrichtingen (ADL). Dit zijn de handelingen die mensen dagelijks in het gewone leven verrichten. De mate waarin een persoon al deze activiteiten zelfstandig kan verrichten zijn een maat voor de totale zelfredzaamheid.\r\n#### Purpose\r\nInformatie over beperkingen in het vermogen om zelfstandig eten te kunnen bereiden en nuttigen is van belang bij het bepalen van de aard en intensiteit van de zorg die aan de patiënt geboden moet worden. In een overdrachtsituatie biedt het de ontvangende organisatie de mogelijkheid te anticiperen op de zwaarte van de te leveren zorg waardoor de continuïteit van de zorgverlening gerealiseerd kan worden.\r\nIndien beleid is ingezet om de zelfredzaamheid te verbeteren, biedt de vastgelegde mate van zelfstandigheid de mogelijkheid de doeltreffendheid van de behandeling vast te stellen.\r\n#### Evidence Base\r\nDe definities van de concepten zijn (deels) ontleend aan de Nederlandse vertaling van de ICNP begrippen.\r\n\r\nNaast deze bouwsteen zijn er meer instrumenten om zelfredzaamheid vast te leggen, zoals KATZ-ADL en de BarthelIndex. De KATZ-ADL wordt vooral gebruikt bij kwetsbare ouderen en de BarthelIndex wordt met name gebruikt voor patiënten met een beroerte. \r\n\r\nDeze bouwsteen evalueert het vermogen tot eten met een driepuntsschaal. Bij KATZ-ADL valt dit onder het aspect Voeden en bij de BarthelIndex onder het aspect EtenDrinken. Het vermogen wordt bij deze twee instrumenten gescoord op een schaal met minder punten.\r\n\r\n\r\n**References**\r\n1. International Classification of Functioning Disability and Health (ICF) [Online] Beschikbaar op: [http:/www.rivm.nl/who-fic/icf.htm](http:/www.rivm.nl/who-fic/icf.htm) [Geraadpleegd: 13 februari 2015]\r\n**Revision History**\r\nPublicatieversie 1.0 (01-07-2015)\r\n\r\nPublicatieversie 3.0 (01-05-2016)\r\nBevat: [ZIB-453](https://bits.nictiz.nl/browse/ZIB-453)\r\n\r\nPublicatieversie 3.1 (04-09-2017)\r\nBevat: [ZIB-530](https://bits.nictiz.nl/browse/ZIB-530), [ZIB-531](https://bits.nictiz.nl/browse/ZIB-531)\r\n\r\nPublicatieversie 3.1.1 (01-09-2020)\r\nBevat: [ZIB-1115](https://bits.nictiz.nl/browse/ZIB-1115)."
          }
        ]
      }
    ]
  },
  "copyright": "Copyright and related rights waived via CC0, https://creativecommons.org/publicdomain/zero/1.0/. This does not apply to information from third parties, for example a medical terminology system. The implementer alone is responsible for identifying and obtaining any necessary licenses or authorizations to utilize third party IP in connection with the specification or otherwise.",
  "fhirVersion": "4.0.1",
  "kind": "logical",
  "abstract": true,
  "type": "https://fhir.healthdata.be/StructureDefinition/LogicalModel/AbilityToEat",
  "baseDefinition": "http://hl7.org/fhir/StructureDefinition/Element",
  "derivation": "specialization",
  "differential": {
    "element": [
      {
        "id": "AbilityToEat",
        "path": "AbilityToEat",
        "short": "AbilityToEat",
        "_short": {
          "extension": [
            {
              "url": "http://hl7.org/fhir/StructureDefinition/translation",
              "extension": [
                {
                  "url": "lang",
                  "valueCode": "nl-NL"
                },
                {
                  "url": "content",
                  "valueMarkdown": "VermogenTotEten"
                }
              ]
            }
          ]
        },
        "definition": "Root concept of the AbilityToEat information model. This root concept contains all data elements of the AbilityToEat information model.",
        "_definition": {
          "extension": [
            {
              "url": "http://hl7.org/fhir/StructureDefinition/translation",
              "extension": [
                {
                  "url": "lang",
                  "valueCode": "nl-NL"
                },
                {
                  "url": "content",
                  "valueMarkdown": "Rootconcept van de bouwsteen VermogenTotEten. Dit concept bevat alle gegevenselementen van de bouwsteen VermogenTotEten."
                }
              ]
            }
          ]
        },
        "min": 0,
        "max": "*"
      },
      {
        "id": "AbilityToEat.Eating",
        "path": "AbilityToEat.Eating",
        "short": "Eating",
        "_short": {
          "extension": [
            {
              "url": "http://hl7.org/fhir/StructureDefinition/translation",
              "extension": [
                {
                  "url": "lang",
                  "valueCode": "nl-NL"
                },
                {
                  "url": "content",
                  "valueMarkdown": "Eten"
                }
              ]
            }
          ]
        },
        "definition": "Feeding oneself: bringing food to the mouth and feeding oneself until satisfied.",
        "_definition": {
          "extension": [
            {
              "url": "http://hl7.org/fhir/StructureDefinition/translation",
              "extension": [
                {
                  "url": "lang",
                  "valueCode": "nl-NL"
                },
                {
                  "url": "content",
                  "valueMarkdown": "Zichzelf voeden: het brengen van voedsel naar de mond en het voeden van zichzelf tot men verzadigd is."
                }
              ]
            }
          ]
        },
        "min": 1,
        "max": "1",
        "type": [
          {
            "code": "CodeableConcept"
          }
        ],
        "binding": {
          "strength": "required",
          "description": "Eating codes",
          "valueSet": "https://fhir.healthdata.be/ValueSet/Eten"
        }
      },
      {
        "id": "AbilityToEat.EatingLimitations",
        "path": "AbilityToEat.EatingLimitations",
        "short": "EatingLimitations",
        "_short": {
          "extension": [
            {
              "url": "http://hl7.org/fhir/StructureDefinition/translation",
              "extension": [
                {
                  "url": "lang",
                  "valueCode": "nl-NL"
                },
                {
                  "url": "content",
                  "valueMarkdown": "EetBeperkingen"
                }
              ]
            }
          ]
        },
        "definition": "Eating constraints specify the patient’s constraints in eating.",
        "_definition": {
          "extension": [
            {
              "url": "http://hl7.org/fhir/StructureDefinition/translation",
              "extension": [
                {
                  "url": "lang",
                  "valueCode": "nl-NL"
                },
                {
                  "url": "content",
                  "valueMarkdown": "Eetbeperkingen verbijzonderen de beperkingen ten aanzien van eten."
                }
              ]
            }
          ]
        },
        "min": 0,
        "max": "*",
        "type": [
          {
            "code": "CodeableConcept"
          }
        ],
        "binding": {
          "strength": "required",
          "description": "EatingLimitations codes",
          "valueSet": "https://fhir.healthdata.be/ValueSet/EetBeperkingen"
        }
      }
    ]
  }
}