{
  "resourceType": "StructureDefinition",
  "id": "HdBe-AbilityToGroom",
  "language": "en-US",
  "extension": [
    {
      "url": "http://hl7.org/fhir/StructureDefinition/resource-effectivePeriod",
      "valuePeriod": {
        "start": "2020-09-01T00:00:00+02:00"
      }
    },
    {
      "url" : "https://fhir.healthdata.be/StructureDefinition/ext-CBB-MM",
      "valueInteger" : 0
    }
  ],
  "url": "https://fhir.healthdata.be/StructureDefinition/LogicalModel/HdBe-AbilityToGroom",
  "name": "HdBeAbilityToGroom",
  "_name": {
    "extension": [
      {
        "url": "http://hl7.org/fhir/StructureDefinition/translation",
        "extension": [
          {
            "url": "lang",
            "valueCode": "nl-NL"
          },
          {
            "url": "content",
            "valueMarkdown": "HdBeVermogenTotUiterlijkeVerzorging"
          }
        ]
      }
    ]
  },
  "title": "HdBe-AbilityToGroom",
  "status": "draft",
  "date": "2022-07-07T15:04:03.2592055+00:00",
  "publisher": "Healthdata.be (Sciensano)",
  "contact": [
    {
      "name": "Service portal – healthdata.be",
      "telecom": [
        {
          "system": "url",
          "value": "https://sciensano.service-now.com/sp",
          "use": "work"
        }
      ]
    }
  ],
  "description": "Personal grooming activity means taking care of skin, nails and hair (and beard or mustache, if applicable). This is a part of self-care. Limitations in this ability indicate a reduced ability to cope for oneself. Washing hair does not fall into this category; it falls under the ability to wash oneself. \r\nThis activity and activities such as those including eating, getting dressed and bathing are also known as activities of daily living (ADL). These are the activities people go through in daily life. The extent to which a person is able to do all these activities by themselves is a measure for their total ability to do things independently.\r\n#### Purpose\r\nInformation on a patient’s ability to perform activities of personal grooming is important in determining the nature and intensity of the care the patient needs. In a transfer situation, it offers the receiving organization the ability to anticipate the intensity of the care to be given to the patient, enabling continuity in healthcare for the patient. \r\nIf policy has been implemented to improve a patient’s ability to do things independently, the entered extent of independence helps to determine the efficiency of the treatment.\r\n#### Evidence Base\r\nThe definitions of the concepts were (partially) taken from the ICNP (International Classification for Nursing Practice). \r\nIn addition to this information model, there are more tools for entering the extent of independence, such as the BarthelIndex. The BarthelIndex is mainly used for patients who have had a stroke. \r\nThis information model evaluates the ability to perform personal grooming activities on a three-point scale.",
  "_description": {
    "extension": [
      {
        "url": "http://hl7.org/fhir/StructureDefinition/translation",
        "extension": [
          {
            "url": "lang",
            "valueCode": "nl-NL"
          },
          {
            "url": "content",
            "valueMarkdown": "Onder uiterlijk verzorging wordt verstaan het schoonhouden/verzorgen van huid (make-up), haar (en indien van toepassing baard/snor) en nagels. En dit is een is een onderdeel van zelfzorg. Beperkingen in dit vermogen duiden op een verminderde zelfredzaamheid op dit gebied. Het wassen van het haar valt hier niet onder, dit valt onder vermogen om zich te wassen.\r\nDeze activiteit wordt samen met activiteiten zoals onder andere eten, zich kleden en zich wassen, ook aangeduid als algemene dagelijkse levensverrichtingen (ADL). Dit zijn de handelingen die mensen dagelijks in het gewone leven verrichten. De mate waarin een persoon al deze activiteiten zelfstandig kan verrichten zijn een maat voor de totale zelfredzaamheid.\r\n#### Purpose\r\nInformatie over het vermogen om zelf zorg te dragen voor de uiterlijke verzorging is van belang bij het bepalen van de aard en intensiteit van de zorg die aan de patiënt geboden moet worden. In een overdrachtsituatie biedt het de ontvangende organisatie de mogelijkheid te anticiperen op de zwaarte van de te leveren zorg waardoor de continuïteit van de zorgverlening gerealiseerd kan worden.\r\nIndien beleid is ingezet om de zelfredzaamheid te verbeteren, biedt de vastgelegde mate van zelfstandigheid de mogelijkheid de doeltreffendheid van de behandeling vast te stellen.\r\n#### Evidence Base\r\nDe definities van de concepten zijn (deels) ontleend aan de ICNP (International Classification for Nursing Practice).\r\nNaast deze bouwsteen zijn er meer instrumenten om zelfredzaamheid vast te leggen, zoals de BarthelIndex. De BarthelIndex wordt met name gebruikt voor patiënten met een beroerte. \r\nDeze bouwsteen evalueert het vermogen tot uiterlijke verzorging met een driepuntsschaal.\r\n\r\n\r\n**References**\r\n1. International Classification for Nursing Practice (ICNP) [Online] Beschikbaar op: [http://www.icn.ch/what-we-do/international-classification-for-nursing-practice-icnpr/](http://www.icn.ch/what-we-do/international-classification-for-nursing-practice-icnpr/) [Geraadpleegd: 15 december 2016]\r\n"
          }
        ]
      }
    ]
  },
  "copyright": "Copyright and related rights waived via CC0, https://creativecommons.org/publicdomain/zero/1.0/. This does not apply to information from third parties, for example a medical terminology system. The implementer alone is responsible for identifying and obtaining any necessary licenses or authorizations to utilize third party IP in connection with the specification or otherwise.",
  "fhirVersion": "4.0.1",
  "kind": "logical",
  "abstract": true,
  "type": "https://fhir.healthdata.be/StructureDefinition/LogicalModel/AbilityToGroom",
  "baseDefinition": "http://hl7.org/fhir/StructureDefinition/Element",
  "derivation": "specialization",
  "differential": {
    "element": [
      {
        "id": "AbilityToGroome",
        "path": "AbilityToGroome",
        "short": "AbilityToGroome",
        "_short": {
          "extension": [
            {
              "url": "http://hl7.org/fhir/StructureDefinition/translation",
              "extension": [
                {
                  "url": "lang",
                  "valueCode": "nl-NL"
                },
                {
                  "url": "content",
                  "valueMarkdown": "VermogenTotUiterlijkeVerzorging"
                }
              ]
            }
          ]
        },
        "definition": "Root concept of the AbilityToGroom information model. This root concept contains all data elements of the AbilityToGroom information model.",
        "_definition": {
          "extension": [
            {
              "url": "http://hl7.org/fhir/StructureDefinition/translation",
              "extension": [
                {
                  "url": "lang",
                  "valueCode": "nl-NL"
                },
                {
                  "url": "content",
                  "valueMarkdown": "Rootconcept van de bouwsteen VermogenTotUiterlijkeVerzorging. Dit rootconcept bevat alle gegevenselementen van de bouwsteen VermogenTotUiterlijkeVerzorging."
                }
              ]
            }
          ]
        },
        "min": 0,
        "max": "*"
      },
      {
        "id": "AbilityToGroome.Grooming",
        "path": "AbilityToGroome.Grooming",
        "short": "Grooming",
        "_short": {
          "extension": [
            {
              "url": "http://hl7.org/fhir/StructureDefinition/translation",
              "extension": [
                {
                  "url": "lang",
                  "valueCode": "nl-NL"
                },
                {
                  "url": "content",
                  "valueMarkdown": "UiterlijkeVerzorging"
                }
              ]
            }
          ]
        },
        "definition": "Personal grooming includes tending to hair and facial hair, such as combing it, or shaving and/or trimming facial hair; skincare, *e.g.* using make-up; nailcare .",
        "_definition": {
          "extension": [
            {
              "url": "http://hl7.org/fhir/StructureDefinition/translation",
              "extension": [
                {
                  "url": "lang",
                  "valueCode": "nl-NL"
                },
                {
                  "url": "content",
                  "valueMarkdown": "Uiterlijke verzorging omvat het verzorgen van hoofd- en gezichtshaar, zoals het met de kam in model brengen en het scheren en/of trimmen van de gezichtsbeharing; het verzorgen van de huid, zoals het aanbrengen van make-up; het verzorgen van de nagels."
                }
              ]
            }
          ]
        },
        "min": 1,
        "max": "1",
        "type": [
          {
            "code": "CodeableConcept"
          }
        ],
        "binding": {
          "strength": "required",
          "description": "Grooming codes",
          "valueSet": "https://fhir.healthdata.be/ValueSet/UiterlijkeVerzorging"
        }
      }
    ]
  }
}