{
  "resourceType": "StructureDefinition",
  "id": "HdBe-LegalSituation",
  "language": "en-US",
  "extension": [
    {
      "url": "http://hl7.org/fhir/StructureDefinition/resource-effectivePeriod",
      "valuePeriod": {
        "start": "2020-09-01T00:00:00+02:00"
      }
    }
  ],
  "url": "https://fhir.healthdata.be/StructureDefinition/LogicalModel/HdBe-LegalSituation",
  "name": "HdBeLegalSituation",
  "_name": {
    "extension": [
      {
        "url": "http://hl7.org/fhir/StructureDefinition/translation",
        "extension": [
          {
            "url": "lang",
            "valueCode": "nl-NL"
          },
          {
            "url": "content",
            "valueMarkdown": "HdBeJuridischeSituatie"
          }
        ]
      }
    ]
  },
  "title": "HdBe LegalSituation",
  "status": "draft",
  "date": "2022-07-07T15:04:03.2592055+00:00",
  "publisher": "Healthdata.be (Sciensano)",
  "contact": [
    {
      "name": "Service portal – healthdata.be",
      "telecom": [
        {
          "system": "url",
          "value": "https://sciensano.service-now.com/sp",
          "use": "work"
        }
      ]
    }
  ],
  "description": "A legal situation can concern a legal status and/or representation.\r\n\r\nThe legal status indicates the basis on which the patient is staying in a healthcare organization. This can be either voluntary or involuntary, however the legal status is always determined by a judge.\r\n\r\nRepresentation is important in situations where a person is legally not competent to give permission and/or factually (partly) incapable of doing so. A representative supports and takes decisions in the interest of the representee when they cannot do so themselves (temporarily or permanently).\r\n\r\n#### Purpose\r\nHealth professionals must be aware of the existence of a legal status or representation because this in part determines what type of care can be provided to the patient. For example, a supporting legal status can be required for using freedom restricting interventions. For a mentally incompetent patient, it must be clear that there is a representative for further decision-making: in this case, the health professional should follow the decision of the representative of the mentally incompetent patient, unless this is incompatible with the care of a good health professional.\r\n#### Evidence Base\r\nIn version 2.0, the new legal statuses resulting from the new legislation on involuntary / compulsory care have been added to the LegalStatus value list. In version 1.0 this list was based on the Vektis value list LegalStatus. However, this list is no longer maintained. That is why the value lists in the new version are based on an internal Nictiz codesystem.\r\n\r\n\r\n#### Instructions\r\nIn case of an intervention, a distinction is made between seclusion and separation. For the purpose of unambiguous recording, the following definitions are used: \r\n\r\nSeclusion: \r\nSeclusion is the confinement of a patient for care, nursing and treatment in a specially designated seclusion room. A seclusion room is generally a bare single room with only a bed, sometimes with a table, a chair, a wardrobe and occasionally washing facilities. Seclusion may not take place in the \"own\" bedroom. \r\n\r\nSeparation: \r\nSeparation is the confinement of a patient in a specially designated enclosed space that has been approved as a separation residence; for several years now the term Extra Secure Room (EBK) has been used for this. The separation space is a specially equipped room, with a mattress or riveted bed and mostly without furniture. Separation should be applied with great caution. The risks of harmful side effects of separation, such as anxiety and stress, are significant. Also in the context of safety, separation should be avoided as much as possible and alternatives should be sought to avert the danger.",
  "_description": {
    "extension": [
      {
        "url": "http://hl7.org/fhir/StructureDefinition/translation",
        "extension": [
          {
            "url": "lang",
            "valueCode": "nl-NL"
          },
          {
            "url": "content",
            "valueMarkdown": "Een juridische situatie kan een juridische status and/of vertegenwoordiging betreffen.\r\n\r\nDe juridische status geeft aan op basis waarvan de patiënt zorg ontvangt dan wel op basis waarvan de patiënt in een zorginstelling verblijft. Dit kan zowel op vrijwillige als onvrijwillige basis, echter wordt een juridische status altijd door een rechter uitgebracht.\r\n\r\nVertegenwoordiging is van belang in situaties waarbij een persoon juridisch niet bevoegd is om toestemming te geven en/of feitelijk niet of niet volledig is in staat dat te doen. Een vertegenwoordiger ondersteunt en neemt beslissingen die in het belang zijn van de vertegenwoordigde, in gevallen dat hij/zij dit zelf (tijdelijk of permanent) niet kan.\r\n\r\n#### Purpose\r\nHulpverleners moeten op de hoogte zijn van het bestaan van een juridische status hetzij vertegenwoordiging omdat dit mede bepaalt wat voor zorg aan de patiënt verleend mag worden. Zo kan bij het inzetten van vrijheidsbeperkende interventies onderbouwing met een juridische status nodig zijn. Bij een wilsonbekwame patiënt moet duidelijk zijn dat er een vertegenwoordiger is voor de verdere besluitvorming: in dit geval volgt de hulpverlener de beslissing van de vertegenwoordiger van de wilsonbekwame patiënt, tenzij dat niet verenigbaar is met de zorg van een goed hulpverlener.\r\n#### Evidence Base\r\nIn versie 2.0 zijn de nieuwe juridische statussen die voortvloeien uit de nieuwe wetgeving rondom onvrijwillige/verplichte zorg aan de waardelijst JuridischeStatus toegevoegd. In versie 1.0 was deze lijst gebaseerd op de Vektis waardelijst JuridischeStatus. Deze lijst wordt echter niet meer onderhouden. Daarom zijn in de nieuwe versie de waardelijsten gebaseerd op een intern Nictiz codestelsel.\r\n\r\n\r\n#### Instructions\r\nBij de interventie wordt onderscheid gemaakt tussen afzondering en separatie. Ten behoeve van eenduidige vastlegging, worden de volgende definities aangehouden:\r\n\r\nAfzondering:\r\nAfzondering is het voor verzorging, verpleging en behandeling insluiten in een speciaal daarvoor bestemde afzonderingskamer. Een afzonderingskamer is over het algemeen een kale eenpersoonskamer met alleen een bed, soms ook met een tafel, een stoel, een kledingkast en een heel enkele keer een wasgelegenheid. Afzondering mag niet plaatsvinden op de ‘eigen’ slaapkamer.\r\n\r\nSeparatie:\r\nSepareren is het insluiten van een patiënt in een speciaal daarvoor bestemde afgesloten en door de minister als separeerverblijf goedgekeurde ruimte; sinds enkele jaren wordt hiervoor ook wel de term Extra Beveiligde Kamer (EBK) gehanteerd. De separeer is een speciaal daarvoor ingerichte kamer, met matras of vastgeklonken bed en veelal zonder meubilair. Separatie dient zeer terughoudend te worden toegepast. De risico’s op schadelijke bijwerkingen van separatie zoals angst en stressgevoelens, zijn aanzienlijk. Ook in het kader van veiligheid dient separatie zoveel mogelijk te worden vermeden en moet er gezocht worden naar alternatieven om het gevaar af te wenden.\r\n**References**\r\n1. Handreiking Argus [Online] Beschikbaar op: [https://www.ggznederland.nl/uploads/publication/Argus%20Registratie%20van%20vrijheidsbeperkende%20interventies%20in%20de%20ggz.pdf](https://www.ggznederland.nl/uploads/publication/Argus%20Registratie%20van%20vrijheidsbeperkende%20interventies%20in%20de%20ggz.pdf) [Geraadpleegd: 12 mei 2020]\r\n2. Handreiking \"Vrijheidsbeperking in het ziekenhuis? Nee, tenzij…\" (V&VN, 2013) [Online] Beschikbaar op: [https://www.venvn.nl/media/matnqkx4/20131120-aanbevelingen-vbi-beleid.pdf](https://www.venvn.nl/media/matnqkx4/20131120-aanbevelingen-vbi-beleid.pdf)[]() [Geraadpleegd: 12 mei 2020]\r\n3. Wet verplichte GGZ (Wvggz) [Online] Beschikbaar op: [https://www.dwangindezorg.nl/wvggz](https://www.dwangindezorg.nl/wvggz) [Geraadpleegd: 12 mei 2020]\r\n4. Wet zorg en dwang (Wzd) [Online] Beschikbar op: [https://www.dwangindezorg.nl/wzd](https://www.dwangindezorg.nl/wzd) [Geraadpleegd: 12 mei 2020]\r\n5. Wet zorg en dwang psychogeriatrische en verstandelijk gehandicapte cliënten [Online] op: [https://zoek.officielebekendmakingen.nl/stcrt-2019-60908.html](https://zoek.officielebekendmakingen.nl/stcrt-2019-60908.html) [Geraadpleegd: 12 mei 2020]\r\n6: Regeling verplichte geestelijke gezondheidszorg [Online] op: [https://zoek.officielebekendmakingen.nl/stcrt-2019-60909.html](https://zoek.officielebekendmakingen.nl/stcrt-2019-60909.html) [Geraadpleegd: 12 mei 2020]\r\n7. Basisset Medisch Specialistische Zorg 2020, hoofdstuk 8.4 Vrijheidsbeperkende interventie (VBI)\n                    [Online] op: [https://www.igj.nl/documenten/indicatorensets/2019/09/03/basisset-medisch-specialistische-zorg-2020](https://www.igj.nl/documenten/indicatorensets/2019/09/03/basisset-medisch-specialistische-zorg-2020) [Geraadpleegd: 12 mei 2020]\r\n**Revision History**\r\nPublicatieversie 1.0 (26-02-2019)\r\nBevat: [ZIB-670](https://bits.nictiz.nl/browse/ZIB-670).\r\n\r\nPublicatieversie 2.0 (01-09-2020)\r\nBevat: [ZIB-1127](https://bits.nictiz.nl/browse/ZIB-1127), [ZIB-1136](https://bits.nictiz.nl/browse/ZIB-1136)."
          }
        ]
      }
    ]
  },
  "copyright": "Copyright and related rights waived via CC0, https://creativecommons.org/publicdomain/zero/1.0/. This does not apply to information from third parties, for example a medical terminology system. The implementer alone is responsible for identifying and obtaining any necessary licenses or authorizations to utilize third party IP in connection with the specification or otherwise.",
  "fhirVersion": "4.0.1",
  "kind": "logical",
  "abstract": true,
  "type": "https://fhir.healthdata.be/StructureDefinition/LogicalModel/LegalSituation",
  "baseDefinition": "http://hl7.org/fhir/StructureDefinition/Element",
  "derivation": "specialization",
  "differential": {
    "element": [
      {
        "id": "LegalSituation",
        "path": "LegalSituation",
        "short": "LegalSituation",
        "_short": {
          "extension": [
            {
              "url": "http://hl7.org/fhir/StructureDefinition/translation",
              "extension": [
                {
                  "url": "lang",
                  "valueCode": "nl-NL"
                },
                {
                  "url": "content",
                  "valueMarkdown": "JuridischeSituatie"
                }
              ]
            }
          ]
        },
        "definition": "Root concept of the LegalSituation information model. This root concept contains all data elements of the LegalSituation information model.",
        "_definition": {
          "extension": [
            {
              "url": "http://hl7.org/fhir/StructureDefinition/translation",
              "extension": [
                {
                  "url": "lang",
                  "valueCode": "nl-NL"
                },
                {
                  "url": "content",
                  "valueMarkdown": "Rootconcept van de bouwsteen JuridischeSituatie. Dit concept bevat alle gegevenselementen van de bouwsteen JuridischeSituatie."
                }
              ]
            }
          ]
        },
        "min": 0,
        "max": "*"
      },
      {
        "id": "LegalSituation.LegalStatus",
        "path": "LegalSituation.LegalStatus",
        "short": "LegalStatus",
        "_short": {
          "extension": [
            {
              "url": "http://hl7.org/fhir/StructureDefinition/translation",
              "extension": [
                {
                  "url": "lang",
                  "valueCode": "nl-NL"
                },
                {
                  "url": "content",
                  "valueMarkdown": "JuridischeStatus"
                }
              ]
            }
          ]
        },
        "definition": "The legal status that applies to the patient. The legal status indicates the basis on which the patient is staying in a healthcare organization. This can be either voluntary or involuntary, however the legal status is always determined by a judge. A patient can also receive healthcare based on a forensic status.",
        "_definition": {
          "extension": [
            {
              "url": "http://hl7.org/fhir/StructureDefinition/translation",
              "extension": [
                {
                  "url": "lang",
                  "valueCode": "nl-NL"
                },
                {
                  "url": "content",
                  "valueMarkdown": "De juridische status die voor de patiënt van toepassing is. De juridische status geeft aan op basis waarvan de patiënt zorg ontvangt dan wel op basis waarvan de patiënt in een zorginstelling verblijft. Dit kan zowel op vrijwillige als onvrijwillige basis, echter wordt een juridische status altijd door een rechter uitgebracht. Ook zijn forensische zorgtitels denkbaar op basis waarvan een patiënt/cliënt zorg ontvangt. Hierbij kan worden gedacht aan een tbs-maatregel."
                }
              ]
            }
          ]
        },
        "min": 0,
        "max": "*",
        "type": [
          {
            "code": "CodeableConcept"
          }
        ],
        "binding": {
          "strength": "required",
          "description": "LegalStatus codes",
          "valueSet": "https://fhir.healthdata.be/ValueSet/JuridischeStatus"
        }
      },
      {
        "id": "LegalSituation.Representation",
        "path": "LegalSituation.Representation",
        "short": "Representation",
        "_short": {
          "extension": [
            {
              "url": "http://hl7.org/fhir/StructureDefinition/translation",
              "extension": [
                {
                  "url": "lang",
                  "valueCode": "nl-NL"
                },
                {
                  "url": "content",
                  "valueMarkdown": "Vertegenwoordiging"
                }
              ]
            }
          ]
        },
        "definition": "In some situations, a person is legally not competent to give permission and/or factually (partly) incapable of doing so. A representative supports and takes decisions in the interest of the representee when they cannot do so themselves (temporarily or permanently). The representative should involve the patient as much as possible in the fulfillment of their tasks and the factual capability of the patient must be honored as much as possible. The Wgbo (Dutch law) determines who are able to become representatives as well as an enforced order.",
        "_definition": {
          "extension": [
            {
              "url": "http://hl7.org/fhir/StructureDefinition/translation",
              "extension": [
                {
                  "url": "lang",
                  "valueCode": "nl-NL"
                },
                {
                  "url": "content",
                  "valueMarkdown": "In sommige situaties is een persoon juridisch niet bevoegd om toestemming te geven en/of feitelijk niet of niet volledig in staat dat te doen. Een vertegenwoordiger ondersteunt en neemt beslissingen die in het belang zijn van de vertegenwoordigde, in gevallen dat hij/zij dit zelf (tijdelijk of permanent) niet kan. De vertegenwoordiger dient de patiënt zo veel als mogelijk bij de vervulling van zijn/haar taken te betrekken en de feitelijke bekwaamheid van de patiënt moet zo veel als mogelijk worden gehonoreerd. In de Wgbo is aangegeven wie als vertegenwoordiger kunnen optreden en geeft hierbij een dwingende volgorde."
                }
              ]
            }
          ]
        },
        "min": 0,
        "max": "*",
        "type": [
          {
            "code": "CodeableConcept"
          }
        ],
        "binding": {
          "strength": "required",
          "description": "Representation codes",
          "valueSet": "https://fhir.healthdata.be/ValueSet/Vertegenwoordiging"
        }
      },
      {
        "id": "LegalSituation.DateStart",
        "path": "LegalSituation.DateStart",
        "short": "DateStart",
        "_short": {
          "extension": [
            {
              "url": "http://hl7.org/fhir/StructureDefinition/translation",
              "extension": [
                {
                  "url": "lang",
                  "valueCode": "nl-NL"
                },
                {
                  "url": "content",
                  "valueMarkdown": "DatumAanvang"
                }
              ]
            }
          ]
        },
        "definition": "The date on which the legal situation of the patient starts.",
        "_definition": {
          "extension": [
            {
              "url": "http://hl7.org/fhir/StructureDefinition/translation",
              "extension": [
                {
                  "url": "lang",
                  "valueCode": "nl-NL"
                },
                {
                  "url": "content",
                  "valueMarkdown": "De datum waarop de juridische situatie van de patiënt start."
                }
              ]
            }
          ]
        },
        "min": 0,
        "max": "1",
        "type": [
          {
            "code": "dateTime"
          }
        ]
      },
      {
        "id": "LegalSituation.DateStop",
        "path": "LegalSituation.DateStop",
        "short": "DateStop",
        "_short": {
          "extension": [
            {
              "url": "http://hl7.org/fhir/StructureDefinition/translation",
              "extension": [
                {
                  "url": "lang",
                  "valueCode": "nl-NL"
                },
                {
                  "url": "content",
                  "valueMarkdown": "DatumEinde"
                }
              ]
            }
          ]
        },
        "definition": "The date on which the legal situation of the patient ends.",
        "_definition": {
          "extension": [
            {
              "url": "http://hl7.org/fhir/StructureDefinition/translation",
              "extension": [
                {
                  "url": "lang",
                  "valueCode": "nl-NL"
                },
                {
                  "url": "content",
                  "valueMarkdown": "De datum waarop de juridische situatie van de patiënt eindigt."
                }
              ]
            }
          ]
        },
        "min": 0,
        "max": "1",
        "type": [
          {
            "code": "dateTime"
          }
        ]
      }
    ]
  }
}