{
  "resourceType": "StructureDefinition",
  "id": "HdBe-FreedomRestrictingIntervention",
  "language": "en-US",
  "extension": [
    {
      "url": "http://hl7.org/fhir/StructureDefinition/resource-effectivePeriod",
      "valuePeriod": {
        "start": "2020-09-01T00:00:00+02:00"
      }
    },
    {
      "url": "https://fhir.healthdata.be/StructureDefinition/ext-CBB-MM",
      "valueInteger": 0
    }
  ],
  "url": "https://fhir.healthdata.be/StructureDefinition/LogicalModel/HdBe-FreedomRestrictingIntervention",
  "name": "HdBeFreedomRestrictingIntervention",
  "_name": {
    "extension": [
      {
        "extension": [
          {
            "url": "lang",
            "valueCode": "nl-BE"
          },
          {
            "url": "content",
            "valueMarkdown": "HdBeVrijheidsbeperkendeInterventie"
          }
        ],
        "url": "http://hl7.org/fhir/StructureDefinition/translation"
      }
    ]
  },
  "title": "HdBe-FreedomRestrictingIntervention",
  "status": "draft",
  "date": "2022-07-07T15:04:03.2592055+00:00",
  "publisher": "Healthdata.be (Sciensano)",
  "contact": [
    {
      "name": "Service portal – healthdata.be",
      "telecom": [
        {
          "system": "url",
          "value": "https://sciensano.service-now.com/sp",
          "use": "work"
        }
      ]
    }
  ],
  "description": "Freedom restricting interventions are interventions that are used against the will of the person concerned and that consciously restrict the person's freedom to protect the person or his environment. This definition includes many forms of freedom restriction, such as (not exhaustive) \r\n\r\n* Forced administration of fluid and nutrition \r\n* Forced administration of medication \r\n* Performing medical checks or other medical procedures \r\n* Restricting freedom of movement \r\n* Admitting to an accommodation and secluding when admitted to an accommodation. \r\n* Exercising supervision \r\n* Searching of clothing or body \r\n* Restriction of visitors and the use of communication means\r\n\r\n\r\nIn the hospital, it is usually about restricting the freedom of movement, for example by using bed rails, moving a chair near to the table or using an arm splint for infusion. In combination with freedom-restricting interventions, soothing medication can be administered. In the case of small children, it is often a question of fixing hands, for example, to prevent a stomach tube from being pulled out. \r\nFor nurses to use it in hospitals, Dutch Nurses Association (V&VN) published a guideline [ref. 3].\r\nIn mental health care, care for the disabled and psychogeriatric care, it always concerns care that is used against the will of the patient.\r\nThe legal framework for using these interventions is (per 1-1-2020) governed by two laws, namely:\r\n\r\n* The Wet verplichte ggz (Wvggz: Mandatory Care In Mental Health Act) for people with psychiatric disorders \r\n* The Wet zorg en dwang (Wzd : Care and Compulsion Act) for people with intellectual disabilities and people with a psychogeriatric disorder, such as dementia.\r\n\r\n\r\nThe Wvggz refers to the term compulsory care, while the Wzd uses the term involuntary care.\r\nA national registration system, the Argus registration, is used to register the interventions in the context of the Wvggz.\r\n#### Purpose\r\nFreedom-restricting interventions (also called involuntary / compulsory care) are applied to prevent or limit serious harm to the person concerned or others or to stabilize or restore the mental health of the person concerned.\r\nImplementing freedom-restricting interventions is risky and can result in damage to the the person concerned if they are not carefully implemented. Health professionals fulfill an important role in identifying risks, observing the effect of the interventions and any changes to the policy in terms of involuntary/compulsory care. Recording all information on the interventions is of major importance for insight into decision-making, implementing, monitoring and evaluating the freedom-restricting interventions.\r\nThe reporting of applied freedom-restricting interventions is also part of the set of quality indicators of the Healthcare and Youth Care Inspectorate\r\n#### Evidence Base\r\nThe Freedom-Restricting Intervention information model applies to both care in the hospital environment and to mental and disabled care and psychogeriatric care.\r\nThe reason for the revision of the information model is the fact that the Special Admissions for Psychiatric Hospitals Act (Bopz), on which the building block was partly based, will be replaced in January 2020 by two new laws, ie: \r\n\r\n* The Wet verplichte ggz (Wvggz) for people with psychiatric disorders \r\n* The Wet zorg en dwang (Wzd) for people with intellectual disabilities and people with a psychogeriatric disorder, such as dementia.\r\n\r\n\r\nThe new laws make new demands on what information is recorded. In the situations where the two above-mentioned laws apply, the information model is only applied when there is involuntary/compulsory care. That is why it is not recorded whether there has been resistance and to what extent. \r\nRestrictions imposed on a voluntary basis - apart from a number of exceptions described in the law - are regarded as regular care and can be recorded with the appropriate information models.\r\nDeciding whether involuntary / compulsory care is involved falls outside the scope of the building block.\r\nThe information model provides a start and end time for recording time registration. The last element is not relevant for all interventions: some interventions are momentary and not duration registrations.The information model offers the possibility to register a start and end time. The last element is not relevant for all interventions: some interventions are momentary and\n                    not duration registrations.\r\nIn this version the information model includes new value lists with interventions based on the aforementioned laws. Although is was attempted to achieve far-reaching harmonization in defining the interventions, it was nevertheless decided to make three separate lists for the different situations in order to simplify the correct application. The situations mentioned simply require other interventions.\r\n\r\n\r\n**Issues**\r\nAt the time of making this version of the information model, a number of legal texts and elaborations thereof in the aforementioned regulations were only available as a draft versions. The information reflects the situation at the end of October 2019. Any changes after this date will be processed in subsequent versions. Final references, such as to the Argus 2.0 registration, will also become available in later versions.",
  "_description": {
    "extension": [
      {
        "extension": [
          {
            "url": "lang",
            "valueCode": "nl-BE"
          },
          {
            "url": "content",
            "valueMarkdown": "Vrijheidsbeperkende interventies bestaan uit maatregelen die worden ingezet om de betrokkene bewust in zijn/haar vrijheid te beperken om betrokkene of diens omgeving te beschermen.\r\nOnder deze definitie vallen vele vormen van vrijheidsbeperking, zoals (niet uitputtend) \r\n\r\n* Onvrijwillig toedienen van vocht en voeding \r\n* Onvrijwillig toedienen van medicatie \r\n* Verrichten van medische controles of andere medische handelingen \r\n* Beperken van bewegingsvrijheid \r\n* Opnemen in een accommodatie en insluiten bij opname in een accommodatie \r\n* Uitoefenen van toezicht \r\n* Onderzoek aan kleding of lichaam \r\n* Beperking van bezoek en het gebruik van communicatie middelen\r\n\r\n\r\nIn het ziekenhuis gaat het meestal om beperking van bewegingsvrijheid door bijvoorbeeld het gebruik van bedhekken, aanschuiven van stoel-tafel of het gebruik van een armspalk bij infuus. Mogelijk gaat deze vrijheidsbeperkende interventie samen met het toedienen van rustgevende medicatie. Bij kleine kinderen gaat het veelal om fixatie van bijv handen ter voorkoming van het uittrekken van bijvoorbeeld een maagsonde.\r\nVoor het toepassen ervan in ziekenhuizen door verpleegkundigen heeft Verpleegkundigen & Verzorgenden Nederland (V&VN) een handreiking gepubliceerd [ref. 3]. \r\nBij de ggz en de gehandicapte zorg en psychogeriatrische zorg gaat het altijd om zorg die tegen de wil van de patiënt wordt toegepast.\r\nHet wettelijk kader voor het toepassen van deze maatregelen wordt (per 1-1-2020) geregeld door twee wetten, te weten: \r\n\r\n* De Wet verplichte ggz (Wvggz) voor mensen met psychiatrische aandoeningen \r\n* De Wet zorg en dwang (Wzd) voor mensen met een verstandelijke beperking en mensen met een psychogeriatrische aandoening, zoals dementie.\r\n\r\n\r\nIn de Wvggz wordt hierbij gesproken van verplichte zorg, terwijl de Wzd de term onvrijwillige zorg hanteert.\r\nVoor de registratie van de maatregelen wordt in het kader van de Wvggz gebruik gemaakt van een landelijk registratiesysteem, de Argusregistratie.\r\n#### Purpose\r\nVrijheidsbeperkende interventies (ook wel onvrijwillige/verplichte zorg) worden toegepast ter voorkoming of beperking van ernstig nadeel voor betrokkene of anderen of voor het stabiliseren of herstellen van de geestelijke gezondheid van de betrokkene.\r\nHet toepassen van vrijheidsbeperkende interventies is risicovol en kan schade voor de betrokkene opleveren indien niet zorgvuldig toegepast. Zorgverleners vervullen een belangrijke rol bij het signaleren van risico's, het observeren van het effect van de interventies en eventuele bijstelling van het beleid t.a.v. vrijheidsbeperkende interventies. Het vastleggen van alle gegevens omtrent de interventie is van groot belang voor inzicht in besluitvorming, toepassing en controle en evaluatie van de vrijheidsbeperkende interventies.\r\nTevens maakt de rapportage van toegepaste vrijheidsbeperkende interventies onderdeel uit van de set kwaliteitsindicatoren van de Inspectie Gezondheidszorg en Jeugd \r\n#### Evidence Base\r\nDe bouwsteen VrijheidsBeperkendeInterventie is zowel van toepassing op de zorg in de ziekenhuis omgeving als op de geestelijke en gehandicapten zorg en de psychogeriatrie.\r\nReden voor de aanpassing van de bouwsteen is het feit dat de Wet Bijzondere opnemingen psychiatrische ziekenhuizen (Bopz), waar de bouwsteen mede op gebaseerd was in januari 2020 vervangen wordt door twee nieuwe wetten, te weten: \r\n\r\n* De Wet verplichte ggz (Wvggz) voor mensen met psychiatrische aandoeningen \r\n* De Wet zorg en dwang (Wzd) voor mensen met een verstandelijke beperking en mensen met een psychogeriatrische aandoening, zoals dementie.\r\n\r\n\r\nDe nieuwe wetten stellen nieuwe eisen aan welke gegevens vast gelegd worden. In de situaties waar de twee bovenstaande wetten van toepassing zijn, wordt de bouwsteen uitsluitend toegepast wanneer er sprake is van onvrijwillige/verplichte zorg. Daarom wordt in deze bouwsteen niet vastgelegd of er verzet is en in welke mate. \r\nVrijwillig opgelegde beperkingen vallen - op een aantal in de wet beschreven uitzonderingen na - onder de reguliere zorg en kunnen vastgelegd worden met de daarvoor bestemde bouwstenen.\r\nDe besluitvorming of er sprake is van onvrijwillige/verplichte zorg valt buiten de scope van de bouwsteen.\r\nDe bouwsteen biedt voor het vastleggen van de tijdsregistratie een begin- en eindtijdstip. Niet voor alle interventies is het laatste element relevant: sommige interventies zijn moment- en geen duurregistraties.\r\nDe bouwsteen heeft in deze versie nieuwe waardelijsten met interventies gekregen die gebaseerd zijn op de genoemde wetten.\n                    Hoewel verregaande harmonisatie is nagestreefd bij de definitie van de interventies is toch besloten drie deels verschillende lijsten te maken voor de verschillende situaties teneinde de juiste toepassing te vereenvoudigen. De genoemde situaties vereisen nu eenmaal andere interventies.\r\n\r\n\r\n**Issues**\r\nTen tijde van het maken van deze versie van de bouwsteen, waren een aantal wetsteksten en uitwerkingen hiervan in genoemde regelingen uitsluitend in concept versie beschikbaar. De bouwsteen reflecteert de situatie van eind oktober 2019. Eventuele wijzigingen na deze datum zullen in volgende versies verwerkt worden. Ook definitieve referenties, zoals naar de Argus 2.0 registratie, zullen ook pas in latere versies beschikbaar komen.\r\n**References**\r\n1. Handreiking Argus [Online] Beschikbaar op: [https://www.ggznederland.nl/uploads/publication/Argus%20Registratie%20van%20vrijheidsbeperkende%20interventies%20in%20de%20ggz.pdf](https://www.ggznederland.nl/uploads/publication/Argus%20Registratie%20van%20vrijheidsbeperkende%20interventies%20in%20de%20ggz.pdf) [Geraadpleegd: 12 mei 2020]\r\n2. Handreiking \"Vrijheidsbeperking in het ziekenhuis? Nee, tenzij…\" (V&VN, 2013) [Online] Beschikbaar op: [https://www.venvn.nl/media/matnqkx4/20131120-aanbevelingen-vbi-beleid.pdf](https://www.venvn.nl/media/matnqkx4/20131120-aanbevelingen-vbi-beleid.pdf)[]() [Geraadpleegd: 12 mei 2020]\r\n3. Wet verplichte GGZ (Wvggz) [Online] Beschikbaar op: [https://www.dwangindezorg.nl/wvggz](https://www.dwangindezorg.nl/wvggz) [Geraadpleegd: 12 mei 2020]\r\n4. Wet zorg en dwang (Wzd) [Online] Beschikbar op: [https://www.dwangindezorg.nl/wzd](https://www.dwangindezorg.nl/wzd) [Geraadpleegd: 12 mei 2020]\r\n5. Wet zorg en dwang psychogeriatrische en verstandelijk gehandicapte cliënten [Online] op: [https://zoek.officielebekendmakingen.nl/stcrt-2019-60908.html](https://zoek.officielebekendmakingen.nl/stcrt-2019-60908.html) [Geraadpleegd: 12 mei 2020]\r\n6: Regeling verplichte geestelijke gezondheidszorg [Online] op: [https://zoek.officielebekendmakingen.nl/stcrt-2019-60909.html](https://zoek.officielebekendmakingen.nl/stcrt-2019-60909.html) [Geraadpleegd: 12 mei 2020]\r\n7. Basisset Medisch Specialistische Zorg 2020, hoofdstuk 8.4 Vrijheidsbeperkende interventie (VBI)\n                    [Online] op: [https://www.igj.nl/documenten/indicatorensets/2019/09/03/basisset-medisch-specialistische-zorg-2020](https://www.igj.nl/documenten/indicatorensets/2019/09/03/basisset-medisch-specialistische-zorg-2020) [Geraadpleegd: 12 mei 2020]"
          }
        ],
        "url": "http://hl7.org/fhir/StructureDefinition/translation"
      }
    ]
  },
  "copyright": "Copyright and related rights waived via CC0, https://creativecommons.org/publicdomain/zero/1.0/. This does not apply to information from third parties, for example a medical terminology system. The implementer alone is responsible for identifying and obtaining any necessary licenses or authorizations to utilize third party IP in connection with the specification or otherwise.",
  "fhirVersion": "4.0.1",
  "kind": "logical",
  "abstract": true,
  "type": "https://fhir.healthdata.be/StructureDefinition/LogicalModel/FreedomRestrictingIntervention",
  "baseDefinition": "http://hl7.org/fhir/StructureDefinition/Element",
  "derivation": "specialization",
  "differential": {
    "element": [
      {
        "id": "FreedomRestrictingIntervention",
        "path": "FreedomRestrictingIntervention",
        "short": "FreedomRestrictingIntervention",
        "_short": {
          "extension": [
            {
              "extension": [
                {
                  "url": "lang",
                  "valueCode": "nl-BE"
                },
                {
                  "url": "content",
                  "valueMarkdown": "VrijheidsbeperkendeInterventie"
                }
              ],
              "url": "http://hl7.org/fhir/StructureDefinition/translation"
            }
          ]
        },
        "definition": "Root concept of the FreedomRestrictingIntervention information model. This root concept contains all data elements of the FreedomRestrictingIntervention information model.",
        "_definition": {
          "extension": [
            {
              "extension": [
                {
                  "url": "lang",
                  "valueCode": "nl-BE"
                },
                {
                  "url": "content",
                  "valueMarkdown": "Rootconcept van de bouwsteen VrijheidsbeperkendeInterventie. Dit concept bevat alle gegevenselementen van de bouwsteen VrijheidsbeperkendeInterventie."
                }
              ],
              "url": "http://hl7.org/fhir/StructureDefinition/translation"
            }
          ]
        },
        "min": 0,
        "max": "*"
      },
      {
        "id": "FreedomRestrictingIntervention.LegallyCapable",
        "path": "FreedomRestrictingIntervention.LegallyCapable",
        "short": "LegallyCapable",
        "_short": {
          "extension": [
            {
              "extension": [
                {
                  "url": "lang",
                  "valueCode": "nl-BE"
                },
                {
                  "url": "content",
                  "valueMarkdown": "Wilsbekwaam"
                }
              ],
              "url": "http://hl7.org/fhir/StructureDefinition/translation"
            }
          ]
        },
        "definition": "Indicator stating whether the patient is deemed capable of overseeing the consequences of a certain procedure, situation or decision.",
        "_definition": {
          "extension": [
            {
              "extension": [
                {
                  "url": "lang",
                  "valueCode": "nl-BE"
                },
                {
                  "url": "content",
                  "valueMarkdown": "Indicator die aangeeft of de patiënt in staat wordt geacht om de gevolgen van een bepaalde handeling, situatie of besluitvorming te overzien."
                }
              ],
              "url": "http://hl7.org/fhir/StructureDefinition/translation"
            }
          ]
        },
        "min": 1,
        "max": "1",
        "type": [
          {
            "code": "boolean"
          }
        ]
      },
      {
        "id": "FreedomRestrictingIntervention.LegallyCapableComment",
        "path": "FreedomRestrictingIntervention.LegallyCapableComment",
        "short": "LegallyCapableComment",
        "_short": {
          "extension": [
            {
              "extension": [
                {
                  "url": "lang",
                  "valueCode": "nl-BE"
                },
                {
                  "url": "content",
                  "valueMarkdown": "WilsbekwaamToelichting"
                }
              ],
              "url": "http://hl7.org/fhir/StructureDefinition/translation"
            }
          ]
        },
        "definition": "Comment on the decisions which the patient is legally capable of making.",
        "_definition": {
          "extension": [
            {
              "extension": [
                {
                  "url": "lang",
                  "valueCode": "nl-BE"
                },
                {
                  "url": "content",
                  "valueMarkdown": "De toelichting op de beslissingen waarvoor de patiënt wils**on**bekwaam is."
                }
              ],
              "url": "http://hl7.org/fhir/StructureDefinition/translation"
            }
          ]
        },
        "min": 0,
        "max": "1",
        "type": [
          {
            "code": "string"
          }
        ]
      },
      {
        "id": "FreedomRestrictingIntervention.LegalSituation",
        "path": "FreedomRestrictingIntervention.LegalSituation",
        "short": "LegalSituation",
        "_short": {
          "extension": [
            {
              "extension": [
                {
                  "url": "lang",
                  "valueCode": "nl-BE"
                },
                {
                  "url": "content",
                  "valueMarkdown": "JuridischeSituatie"
                }
              ],
              "url": "http://hl7.org/fhir/StructureDefinition/translation"
            }
          ]
        },
        "definition": "The legal situation that applies to the patient during the intervention.",
        "_definition": {
          "extension": [
            {
              "extension": [
                {
                  "url": "lang",
                  "valueCode": "nl-BE"
                },
                {
                  "url": "content",
                  "valueMarkdown": "De juridische situatie die voor de patiënt van toepassing is gedurende de interventie."
                }
              ],
              "url": "http://hl7.org/fhir/StructureDefinition/translation"
            }
          ]
        },
        "min": 0,
        "max": "1",
        "type": [
          {
            "code": "Reference",
            "targetProfile": [
              "https://fhir.healthdata.be/StructureDefinition/LogicalModel/HdBe-LegalSituation"
            ]
          }
        ]
      },
      {
        "id": "FreedomRestrictingIntervention.TypeOfIntervention",
        "path": "FreedomRestrictingIntervention.TypeOfIntervention",
        "short": "TypeOfIntervention",
        "_short": {
          "extension": [
            {
              "extension": [
                {
                  "url": "lang",
                  "valueCode": "nl-BE"
                },
                {
                  "url": "content",
                  "valueMarkdown": "SoortInterventie"
                }
              ],
              "url": "http://hl7.org/fhir/StructureDefinition/translation"
            }
          ]
        },
        "definition": "The type of intervention describes the kind of freedom-restricting intervention/involuntary care.",
        "_definition": {
          "extension": [
            {
              "extension": [
                {
                  "url": "lang",
                  "valueCode": "nl-BE"
                },
                {
                  "url": "content",
                  "valueMarkdown": "Het soort interventie beschrijft het type vrijheidsbeperkende interventie/onvrijwillige zorg."
                }
              ],
              "url": "http://hl7.org/fhir/StructureDefinition/translation"
            }
          ]
        },
        "min": 1,
        "max": "1",
        "type": [
          {
            "code": "CodeableConcept"
          }
        ]
      },
      {
        "id": "FreedomRestrictingIntervention.ReasonForUse",
        "path": "FreedomRestrictingIntervention.ReasonForUse",
        "short": "ReasonForUse",
        "_short": {
          "extension": [
            {
              "extension": [
                {
                  "url": "lang",
                  "valueCode": "nl-BE"
                },
                {
                  "url": "content",
                  "valueMarkdown": "RedenVanToepassen"
                }
              ],
              "url": "http://hl7.org/fhir/StructureDefinition/translation"
            }
          ]
        },
        "definition": "The reason for use provides the justification for applying involuntary care",
        "_definition": {
          "extension": [
            {
              "extension": [
                {
                  "url": "lang",
                  "valueCode": "nl-BE"
                },
                {
                  "url": "content",
                  "valueMarkdown": "Reden van toepassen geeft de onderbouwing voor het toepassen van de onvrijwillige zorg"
                }
              ],
              "url": "http://hl7.org/fhir/StructureDefinition/translation"
            }
          ]
        },
        "min": 0,
        "max": "1",
        "type": [
          {
            "code": "CodeableConcept"
          }
        ],
        "binding": {
          "strength": "extensible",
          "description": "ReasonForUse codes",
          "valueSet": "https://fhir.healthdata.be/ValueSet/ReasonForUse"
        }
      },
      {
        "id": "FreedomRestrictingIntervention.Assent",
        "path": "FreedomRestrictingIntervention.Assent",
        "short": "Assent",
        "_short": {
          "extension": [
            {
              "extension": [
                {
                  "url": "lang",
                  "valueCode": "nl-BE"
                },
                {
                  "url": "content",
                  "valueMarkdown": "Instemming"
                }
              ],
              "url": "http://hl7.org/fhir/StructureDefinition/translation"
            }
          ]
        },
        "definition": "The assent given to the health professional(s) by legal representative to implement the involuntary care.",
        "_definition": {
          "extension": [
            {
              "extension": [
                {
                  "url": "lang",
                  "valueCode": "nl-BE"
                },
                {
                  "url": "content",
                  "valueMarkdown": "De door de wettelijke vertegenwoordiger aan de zorgverlener(s) gegeven instemming voor het uitvoeren van de onvrijwillige zorg."
                }
              ],
              "url": "http://hl7.org/fhir/StructureDefinition/translation"
            }
          ]
        },
        "min": 0,
        "max": "1",
        "type": [
          {
            "code": "CodeableConcept"
          }
        ],
        "binding": {
          "strength": "required",
          "description": "Assent codes",
          "valueSet": "https://fhir.healthdata.be/ValueSet/Assent"
        }
      },
      {
        "id": "FreedomRestrictingIntervention.Start",
        "path": "FreedomRestrictingIntervention.Start",
        "short": "Start",
        "_short": {
          "extension": [
            {
              "extension": [
                {
                  "url": "lang",
                  "valueCode": "nl-BE"
                },
                {
                  "url": "content",
                  "valueMarkdown": "Begin"
                }
              ],
              "url": "http://hl7.org/fhir/StructureDefinition/translation"
            }
          ]
        },
        "definition": "The date and time on which the intervention was carried out for point in time registrations or the date and time on which the intervention was started for duration registrations.",
        "_definition": {
          "extension": [
            {
              "extension": [
                {
                  "url": "lang",
                  "valueCode": "nl-BE"
                },
                {
                  "url": "content",
                  "valueMarkdown": "De datum en tijd waarop de interventie is uitgevoerd bij moment registraties dan wel de datum en tijd waarop de interventie gestart is bij duurregistraties."
                }
              ],
              "url": "http://hl7.org/fhir/StructureDefinition/translation"
            }
          ]
        },
        "min": 1,
        "max": "1",
        "type": [
          {
            "code": "dateTime"
          }
        ]
      },
      {
        "id": "FreedomRestrictingIntervention.End",
        "path": "FreedomRestrictingIntervention.End",
        "short": "End",
        "_short": {
          "extension": [
            {
              "extension": [
                {
                  "url": "lang",
                  "valueCode": "nl-BE"
                },
                {
                  "url": "content",
                  "valueMarkdown": "Einde"
                }
              ],
              "url": "http://hl7.org/fhir/StructureDefinition/translation"
            }
          ]
        },
        "definition": "The date and time at which the intervention ended.",
        "_definition": {
          "extension": [
            {
              "extension": [
                {
                  "url": "lang",
                  "valueCode": "nl-BE"
                },
                {
                  "url": "content",
                  "valueMarkdown": "De datum en tijd waarop de interventie is beëindigd."
                }
              ],
              "url": "http://hl7.org/fhir/StructureDefinition/translation"
            }
          ]
        },
        "min": 0,
        "max": "1",
        "type": [
          {
            "code": "dateTime"
          }
        ]
      }
    ]
  }
}