{
  "resourceType": "StructureDefinition",
  "id": "HdBe-AbilityToWashOneself",
  "language": "en-US",
  "extension": [
    {
      "url": "http://hl7.org/fhir/StructureDefinition/resource-effectivePeriod",
      "valuePeriod": {
        "start": "2020-09-01T00:00:00+02:00"
      }
    },
    {
      "url" : "https://fhir.healthdata.be/StructureDefinition/ext-CBB-MM",
      "valueInteger" : 0
    }
  ],
  "url": "https://fhir.healthdata.be/StructureDefinition/LogicalModel/HdBe-AbilityToWashOneself",
  "name": "HdBeAbilityToWashOneself",
  "_name": {
    "extension": [
      {
        "url": "http://hl7.org/fhir/StructureDefinition/translation",
        "extension": [
          {
            "url": "lang",
            "valueCode": "nl-NL"
          },
          {
            "url": "content",
            "valueMarkdown": "HdBeVermogenTotZichWassen"
          }
        ]
      }
    ]
  },
  "title": "HdBe AbilityToWashOneself",
  "status": "draft",
  "date": "2022-07-07T15:04:03.2592055+00:00",
  "publisher": "Healthdata.be (Sciensano)",
  "contact": [
    {
      "name": "Service portal – healthdata.be",
      "telecom": [
        {
          "system": "url",
          "value": "https://sciensano.service-now.com/sp",
          "use": "work"
        }
      ]
    }
  ],
  "description": "Being able to bathe independently is part of self-care. Limitations in this ability indicate a reduced ability to cope for oneself. \r\nThis activity and activities such as those including eating, drinking, and dressing are also known as activities of daily living (ADL). These are the activities people go through in daily life. The extent to which a person is able to do all these activities by themselves is a measure for their total ability to do things independently.\r\n\r\n#### Purpose\r\nInformation on limitations in a patient’s ability to bathe themselves is important in determining the nature and intensity of the care the patient needs. In a transfer situation, it gives the receiving organization the ability to anticipate the intensity of the care to be given to the patient, enabling continuity in healthcare for the patient. \r\nIf policy has been implemented to improve a patient’s ability to do things independently, the entered extent of independence helps to determine the efficiency of the treatment.\r\n\r\n#### Evidence Base\r\nIn addition to this information model, there are other tools to record independence, such as the KATZ-ADL and the BarthelIndex. The KATZ-ADL is mainly used for vulnerable seniors and the BarthelIndex is mainly used for patients who have had a stroke. \r\nThis information model evaluates the ability to bathe on a three-point scale. In the KATZ-ADL and in the BarthelIndex, this falls under the aspect of Grooming. In these two tools, the ability is scored on a scale with fewer points.",
  "_description": {
    "extension": [
      {
        "url": "http://hl7.org/fhir/StructureDefinition/translation",
        "extension": [
          {
            "url": "lang",
            "valueCode": "nl-NL"
          },
          {
            "url": "content",
            "valueMarkdown": "Zich zelfstandig kunnen wassen is een onderdeel van zelfzorg. Beperkingen in dit vermogen duiden op een verminderde zelfredzaamheid op dit gebied.\r\nDeze activiteit wordt samen met activiteiten zoals onder andere eten, drinken en zich kleden, ook aangeduid als algemene dagelijkse levensverrichtingen (ADL). Dit zijn de handelingen die mensen dagelijks in het gewone leven verrichten. De mate waarin een persoon al deze activiteiten zelfstandig kan verrichten zijn een maat voor de totale zelfredzaamheid.\r\n#### Purpose\r\nInformatie over beperkingen in het vermogen om zich zelfstandig te kunnen wassen is van belang bij het bepalen van de aard en intensiteit van de zorg die aan de patiënt geboden moet worden. In een overdrachtsituatie biedt het de ontvangende organisatie de mogelijkheid te anticiperen op de zwaarte van de te leveren zorg waardoor continuïteit van de zorgverlening gerealiseerd kan worden.\r\nIndien beleid is ingezet om de zelfredzaamheid te verbeteren, biedt de vastgelegde mate van zelfstandigheid de mogelijkheid de doeltreffendheid van de behandeling vast te stellen.\r\n#### Evidence Base\r\nNaast deze bouwsteen zijn er meer instrumenten om zelfredzaamheid vast te leggen, zoals KATZ-ADL en de BarthelIndex. De KATZ-ADL wordt vooral gebruikt bij kwetsbare ouderen en de BarthelIndex wordt met name gebruikt voor patiënten met een beroerte. \r\nDeze bouwsteen evalueert het vermogen tot zich wassen met een driepuntsschaal. Bij KATZ-ADL valt dit onder het aspect Wassen en bij de BarthelIndex onder het aspect Uiterlijke Verzorging. Het vermogen wordt bij deze twee instrumenten gescoord op een schaal met minder punten.\r\n\r\n\r\n**References**\r\n1. International Classification of Functioning Disability and Health (ICF) [Online] Beschikbaar op: [http:/www.rivm.nl/who-fic/icf.htm](http:/www.rivm.nl/who-fic/icf.htm) [Geraadpleegd: 13 februari 2015]\r\n"
          }
        ]
      }
    ]
  },
  "copyright": "Copyright and related rights waived via CC0, https://creativecommons.org/publicdomain/zero/1.0/. This does not apply to information from third parties, for example a medical terminology system. The implementer alone is responsible for identifying and obtaining any necessary licenses or authorizations to utilize third party IP in connection with the specification or otherwise.",
  "fhirVersion": "4.0.1",
  "kind": "logical",
  "abstract": true,
  "type": "https://fhir.healthdata.be/StructureDefinition/LogicalModel/AbilityToWashOneself",
  "baseDefinition": "http://hl7.org/fhir/StructureDefinition/Element",
  "derivation": "specialization",
  "differential": {
    "element": [
      {
        "id": "AbilityToWashOneself",
        "path": "AbilityToWashOneself",
        "short": "AbilityToWashOneself",
        "_short": {
          "extension": [
            {
              "url": "http://hl7.org/fhir/StructureDefinition/translation",
              "extension": [
                {
                  "url": "lang",
                  "valueCode": "nl-NL"
                },
                {
                  "url": "content",
                  "valueMarkdown": "VermogenTotZichWassen"
                }
              ]
            }
          ]
        },
        "definition": "Root concept of the AbilityToWashOneself information model. This root concept contains all data elements of the AbilityToWashOneself information model.",
        "_definition": {
          "extension": [
            {
              "url": "http://hl7.org/fhir/StructureDefinition/translation",
              "extension": [
                {
                  "url": "lang",
                  "valueCode": "nl-NL"
                },
                {
                  "url": "content",
                  "valueMarkdown": "Rootconcept van de bouwsteen VermogenTotZichWassen. Dit rootconcept bevat alle gegevenselementen van de bouwsteen VermogenTotZichWassen."
                }
              ]
            }
          ]
        },
        "min": 0,
        "max": "*"
      },
      {
        "id": "AbilityToWashOneself.BathingOneself",
        "path": "AbilityToWashOneself.BathingOneself",
        "short": "BathingOneself",
        "_short": {
          "extension": [
            {
              "url": "http://hl7.org/fhir/StructureDefinition/translation",
              "extension": [
                {
                  "url": "lang",
                  "valueCode": "nl-NL"
                },
                {
                  "url": "content",
                  "valueMarkdown": "ZichWassen"
                }
              ]
            }
          ]
        },
        "definition": "The washing and drying of the entire body, or body parts, such as bathing, showering, washing of hands and feet, face and hair. \r\nThe BodyPartToBeBathed concept offers the option to specify to which part of the body the limitation applies.",
        "_definition": {
          "extension": [
            {
              "url": "http://hl7.org/fhir/StructureDefinition/translation",
              "extension": [
                {
                  "url": "lang",
                  "valueCode": "nl-NL"
                },
                {
                  "url": "content",
                  "valueMarkdown": "Het wassen en afdrogen van het gehele lichaam, of lichaamsdelen, waaronder baden, douchen, wassen van handen en voeten, gezicht en haar.\r\nIn het concept TeWassenLichaamsdeel kan nader aangegeven worden voor welk lichaamsdeel de beperking geldt."
                }
              ]
            }
          ]
        },
        "min": 1,
        "max": "1",
        "type": [
          {
            "code": "CodeableConcept"
          }
        ],
        "binding": {
          "strength": "required",
          "description": "BathingOneself codes",
          "valueSet": "https://fhir.healthdata.be/ValueSet/ZichWassen"
        }
      },
      {
        "id": "AbilityToWashOneself.BodyPartToBeBathed",
        "path": "AbilityToWashOneself.BodyPartToBeBathed",
        "short": "BodyPartToBeBathed",
        "_short": {
          "extension": [
            {
              "url": "http://hl7.org/fhir/StructureDefinition/translation",
              "extension": [
                {
                  "url": "lang",
                  "valueCode": "nl-NL"
                },
                {
                  "url": "content",
                  "valueMarkdown": "TeWassenLichaamsdeel"
                }
              ]
            }
          ]
        },
        "definition": "The part or parts of the body for which help bathing is wanted/necessary.",
        "_definition": {
          "extension": [
            {
              "url": "http://hl7.org/fhir/StructureDefinition/translation",
              "extension": [
                {
                  "url": "lang",
                  "valueCode": "nl-NL"
                },
                {
                  "url": "content",
                  "valueMarkdown": "Het lichaamsdeel of de lichaamsdelen waarvoor ondersteuning bij wassen gewenst/noodzakelijk is."
                }
              ]
            }
          ]
        },
        "min": 0,
        "max": "*",
        "type": [
          {
            "code": "CodeableConcept"
          }
        ],
        "binding": {
          "strength": "required",
          "description": "BodyPartToBeBathed codes",
          "valueSet": "https://fhir.healthdata.be/ValueSet/TeWassenLichaamsdeel"
        }
      }
    ]
  }
}